FILEPATH = "images/"

USERS_IMAGES = {
    (
        '8к1191', '8к1591', '8к1391', '8к1111',
        '7к1191', '7к1591', '7к1391', '61391'
    ): f"{FILEPATH}0.jpeg",
    (
        '8к2491', '8к2492', '8к2493', '7к2491',
        '7к2492', '7к2493', '8к2411',
    ): f"{FILEPATH}1.jpeg",
    (
        '8к3791', '8к3291', '7к3791', '7к3291'
    ): f"{FILEPATH}2.jpeg",
    (
        '7к1111', '61191', '61591', '61111',
        '51191', '51591', '51592', '51391',
        '51392'
    ): f"{FILEPATH}3.jpeg",
    (
        '62492', '62493', '62411', '52491',
        '52492', '52493', '62491', '7к2411'
    ):  f"{FILEPATH}4.jpeg",
    (
        '63791', '63291', '53791', '53291',
        '53292'
    ): f"{FILEPATH}5.jpeg",
}

USERS_IMAGES_FULL = {
    group: value for key, value in USERS_IMAGES.items() for group in key
}
